Repository: tar-mirror/gnu-bison
Catalog: po/*.po
Languages: de, es, it

source: too many states (max %d)
it: troppi stati (massimo %d)

source: Unknown system error
it: Errore di sistema sconosciuto

source: warning:
it: attenzione:

source: fatal error:
it: errore fatale:

source: Conflict in state %d between rule %d and token %s resolved as %s.
de: Konflikt in Zustand %d zwischen Regel %d and Token %s wurde %s.
es: El conflicto en el estado %s entre la regla %d y el terminal %s se resuelve como %s.
it: Conflitto nello stato %d tra la regola %d e il token %s risolto come %s.

source: reduce
de: durch Reduzierung gelöst
it: riduzione

source: an error
de: als Fehler betrachtet
es: un error
it: un errore

source: %d shift/reduce conflict
it: %d conflitto shift/riduzione

source: and
it: e

source: %d reduce/reduce conflict
it: %d conflitto riduzione/riduzione

source: State %d contains
it: Lo stato %d contiene

source: conflicts:
de: Konflikte:
es: conflictos:
it: conflitti:

source: %d shift/reduce
de: %d Schiebe/Reduziere
es: %d desplazamiento(s)/reducción(ones)
it: %d shift/riduzione

source: %d reduce/reduce
de: %d Reduziere/Reduziere
es: %d reducción(ones)/reducción(ones)
it: %d riduzione/riduzione

source: %s contains
de: %s enthält
es: %s contiene
it: %s contiene

source: expected %d shift/reduce conflict
it: atteso %d conflitto shift/riduzione

source: %-4s [reduce using rule %d (%s)]
de: %-4s [reduziere mit Regel %d (%s)]
es: %-4s [reduce usando la regla %d (%s)]
it: %-4s [riduzione con la regole %d (%s)]

source: $default reduce using rule %d (%s)
de: $default reduziere mit Regel %d (%s)
es: $default reduce usando la regla %d (%s)
it: $default riduzione con la regola %d (%s)

source: %-4s reduce using rule %d (%s)
de: %-4s reduziere mit Tegel %d (%s)
es: %-4s reduce usando la regla %d (%s)
it: %-4s riduzione con la regola %d (%s)

source: $default reduce using rule %d (%s)
de: $default reduziere mit Regel %d (%s)
es: $default reduce usando la regla %d (%s)
it: $default riduzione con la regola %d (%s)

source: cannot open file `%s'
it: impossibile aprire il file `%s'

source: cannot close file
it: impossibile chiudere il file `%s'

source: GNU bison generates parsers for LALR(1) grammars.
it: GNU bison genera parser per grammatiche LALR(1).

source: Usage: %s [OPTION]... FILE
it: Utilizzo: %s [OPZIONE]... FILE

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
it: Se un argomento è indicato come obbligatorio in un'opzione lunga, allora è obbligatorio anche per l'equivalente opzione corta. Analogamente per gli argomenti opzionali.

source: Operation modes: -h, --help display this help and exit -V, --version output version information and exit -y, --yacc emulate POSIX yacc
it: Modalità operative: -h, --help mostra questo aiuto ed esce -V, --version mostra informazioni sulla versione ed esce -y, --yacc emula il comportamento di POSIX yacc

source: Parser: -S, --skeleton=FILE specify the skeleton to use -t, --debug instrument the parser for debugging --locations enable locations computation -p, --name-prefix=PREFIX prepend PREFIX to the external symbols -l, --no-lines don't generate `#line' directives -n, --no-parser generate the tables only -k, --token-table include a table of token names
it: -S, --skeleton=FILE specifica lo scheletro da usare -t, --debug aggiunge informazioni di debug al parser --locations abilita il calcolo delle locazioni (@N) -p, --name-prefix=PREFIX prepone PREFIX ai simboli globali -l, --no-lines non genera direttive `#line' -n, --no-parser genera le sole tabelle -k, --token-table include una tabella di nomi dei token

source: Output: -d, --defines also produce a header file -v, --verbose also produce an explanation of the automaton -b, --file-prefix=PREFIX specify a PREFIX for output files -o, --output=FILE leave output to FILE -g, --graph also produce a VCG description of the automaton
it: Output: -d, --defines produce anche uno header -v, --verbose produce anche una spiegazione dell'automa -b, --file-prefix=PREFIX specifica un prefisso per il file di output -o, --output=FILE lascia l'output in FILE -g, --graph produce anche una descrizione VCG dell'automa

source: Report bugs to <bug-bison@gnu.org>.
it: Segnalare eventuali bug a <bug-bison@gnu.org>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
it: Questo e' software libero; vedere il sorgente per le condizioni cui e' sottoposta la copia. NON c'è ALCUNA garanzia, neanche di COMMERCIABILITA` o di ADEGUATEZZA AD UN PARTICOLARE SCOPO.

source: `%s' is no longer supported
it: `%s' non è più supportato

source: Try `%s --help' for more information.
it: Provare `%s --help' per ulteriori informazioni.

source: %s: no grammar file given
de: %s: keine Grammatik-Datei angegeben
es: %s: no se ha especificado ningún fichero de gramática
it: %s: nessun file grammatica specificato

source: %s: extra arguments ignored after `%s'
it: %s: ignorati gli argomenti successivi a `%s'

source: too many gotos (max %d)
it: troppi goto (max %d)

source: unexpected `/' found and ignored
de: »/« wird hier nicht erwartet und wird deshalb ignoriert
es: se ha encontrado `/' cuando no se esperaba, no se tendrán en cuenta
it: `/' inatteso, trovato e ignorato

source: unterminated comment
de: unbeendeter Kommentar
es: comentario sin terminar
it: commento non terminato

source: unexpected end of file
it: fine del file inattesa

source: unescaped newline in constant
de: nicht maskiertes Zeilenendezeichen in Konstante
es: salto de línea en constante sin secuencia de escape
it: fine di linea non preceduta da `\' in una costante

source: octal value outside range 0...255: `\%o'
de: oktaler Zahlenwert außerhalb des Bereichs 0...255: »\%o«
es: valor octal fuera del rango 0...255: `\%o'
it: valore ottale fuori dall'intervallo 0...255: `\%o'

source: hexadecimal value above 255: `\x%x'
de: hexadezimaler Zahlenwert größer als 255: »\x%x«
es: valor hexadecimal mayor que 255: `\x%x'
it: valore esadecimale superiore a 255: `\x%x'

source: unknown escape sequence: `\' followed by `%s'
de: unbekanntes Fluchtzeichen: »\« gefolgt von »%s«
es: secuencia de escape desconocida: `\' seguido de `%s'
it: sequenza di escape sconosciuta: `\' seguito da `%s'

source: unterminated type name at end of file
de: unerwarteter Typname am Ende der Datei
es: nombre de tipo sin terminar al final del fichero
it: nome di tipo non terminato a fine file

source: unterminated type name
de: unerwarteter Typname
es: nombre de tipo sin terminar
it: nome di tipo non terminato

source: use "..." for multi-character literal tokens
de: für Literal mit mehreren Zeichen bitte "..." verwenden
es: use "..." para terminales literales multicarácter
it: usa "..." per token letterali di più caratteri

source: `%s' supports no argument: %s
it: `%s' non supporta argomenti: %s

source: `%s' requires an argument
it: `%s' richiede un argomento

source: maximum table size (%d) exceeded
it: ecceduta la dimensione massima di una tabella (%d)

source: type %d is %s
de: Typ %d ist %s
es: el tipo %d es %s
it: il tipo %d è %s

source: (rule %d)
de: (Regel %d)
es: (regla %d)
it: (regola %d)

source: $default accept
de: $default akzeptiere
es: $default aceptar
it: $default accetta

source: NO ACTIONS
de: KEINE AKTIONEN
es: SIN ACCIONES
it: NESSUNA AZIONE

source: $ go to state %d
de: $ gehe zu Zustand %d über
es: $ ir al estado %d
it: $ prosecuzione allo stato %d

source: %-4s shift, and go to state %d
de: %-4s Schiebe und gehe zu Zustand %d über
es: %-4s desplazar e ir al estado %d
it: %-4s shift e prosecuzione allo stato %d

source: %-4s error (nonassociative)
de: %-4s Fehler (nicht assoziativ)
es: %-4s error (no asociativo)
it: %-4s errore (non associativo)

source: %-4s go to state %d
de: %-4s gehe zu Zustand %d über
es: %-4s ir al estado %d
it: %-4s prosecuzione allo stato %d

source: state %d
it: stato %d

source: Grammar
it: Grammatica

source: Number, Line, Rule
it: Numero, Linea, Regola

source: empty
it: vuoto

source: Terminals, with rules where they appear
it: Simboli terminali e regole in cui appaiono

source: Nonterminals, with rules where they appear
it: Simboli nonterminali e regole in cui appaiono

source: on left:
de: auf der linken Seite:
es: en la izquierda:
it: nel primo membro:

source: on right:
de: auf der rechten Seite:
es: en la derecha:
it: nel secondo membro:

source: %-4s error (nonassociative)
it: %-4s errore (non associativo)

source: $default reduce using rule %d (%s)
it: $default riduzione con la regola %d (%s)

source: Skipping to next \n
de: Überspringe Zeichen bis zum nächsten \n
es: Saltando al siguiente \n
it: Passo al successivo \n

source: Skipping to next %c
de: Überspringe Zeichen bis zum nächten %c
es: Saltando al siguiente %c
it: Passo al successivo %c

source: invalid $ value
de: unzulässiger $ Wert
es: valor $ no válido
it: valore $ non valido

source: unterminated string at end of file
de: unbeendete Zeichenkette am Ende der Datei
es: cadena sin terminar al final del fichero
it: stringa non terminata alla fine del file

source: unterminated string
de: unbeendete Zeichenkette
es: cadena sin terminar
it: stringa non terminata

source: %s is invalid
it: %s non è valido

source: $$ of `%s' has no declared type
de: $$ von »%s« hat keine deklarierten Wert
es: $$ de `%s' no tiene tipo declarado
it: Manca una dichiarazione di tipo per $$ di `%s'

source: $%d of `%s' has no declared type
it: Manca una dichiarazione di tipo per $%d di `%s'

source: unterminated `%{' definition
de: unbeendete »%{« Definition
es: definición `%{' sin terminar
it: definizione `%{' non terminata

source: Premature EOF after %s
it: Fine di file prematura dopo %s

source: symbol `%s' used more than once as a literal string
it: simbolo `%s' usato più di una volta in una stringa letterale

source: symbol `%s' given more than one literal string
it: il simbolo `%s' dà pi&grave; di una stringa letterale

source: symbol %s redefined
de: Symbol %s noch einmal definiert
es: redefinido el símbolo %s
it: simbolo %s ridefinito

source: type redeclaration for %s
de: erneute Deklaration des Typs für %s
es: redeclaración del tipo de %s
it: tipo dichiarato due volte per %s

source: `%s' is invalid in %s
de: »%s« ist in %s nicht erlaubt
es: `%s' no es válido en %s
it: `%s' non è valido in %s

source: multiple %s declarations
it: dichiarazioni multiple per %s

source: invalid %s declaration
it: dichiarazione %s non valida

source: %type declaration has no <typename>
de: %type Deklaration hat keinen <Typ-Namen>
es: la declaración %type no tiene <nombre-tipo>
it: dichiarazione %type senza <nome di tipo>

source: invalid %%type declaration due to item: %s
it: dichiarazione %%type non valida per la presenza di `%s'

source: redefining precedence of %s
de: Stellenwertigkeit von %s wird erneut definiert
es: redefinición de la precedencia de %s
it: precedenza di `%s' definita due volte

source: invalid text (%s) - number should be after identifier
de: unzulässiger Text (%s) - Nummer sollte nach Bezeichner kommen
es: texto no válido (%s) - el número debería estar después del identificador
it: testo non valido (%s) - il numero dovrebbe seguire l'identificatore

source: unexpected item: %s
de: unerwartetes Symbol: %s
es: ítem inesperado: %s
it: elemento inatteso: %s

source: unmatched %s
it: %s non bilanciato

source: argument of %%expect is not an integer
it: L'argomento di %%expect non è un intero

source: unrecognized item %s, expected an identifier
de: unerwartetes Symbol %s, hier wird ein Bezeichner erwartet
es: no se reconoce el ítem %s, se esperaba un identificador
it: elemento %s non riconosciuto, atteso un identificatore

source: expected string constant instead of %s
de: hier wird eine Zeichenkette erwartet, nicht %s
es: se esperaba una cadena constante en lugar de %s
it: attesa una costante stringa invece di %s

source: unrecognized: %s
de: unbekannt: %s
es: no reconocido: %s
it: non riconosciuto: %s

source: no input grammar
de: keine Eingabe-Grammatik
es: no hay gramática de entrada
it: nessuna grammatica di input

source: unknown character: %s
de: unbekanntes Zeichen: %s
es: carácter desconocido: %s
it: carattere sconosciuto: %s

source: unterminated %guard clause
it: clausola %guard non terminata

source: ill-formed rule: initial symbol not followed by colon
de: falsch geformte Regel: führendes Symbol wird nicht von einem Semikolon gefolgt
es: regla mal formada: el símbolo inicial no está seguido por :
it: regola malformata: simbolo iniziale non seguito da `:'

source: grammar starts with vertical bar
de: Grammatik fängt mit einem vertikalen Strich (»|«) an
es: la gramática comienza con una barra vertical
it: la grammatica comincia con un `|'

source: rule given for %s, which is a token
de: Regel für %s vorhanden, welches aber ein Token ist
es: se ha dado una regla para %s, que es un terminal
it: fornita una regola per il token %s

source: two @prec's in a row
de: zwei @prec Anweisungen nacheinander
es: dos @prec en una línea
it: due @prec di seguito

source: %%guard present but %%semantic_parser not specified
de: %%guard Anweisung vorhanden, jedoch wird %%semantic_parser nicht angegeben
es: %%guard presente pero %%semantic_parser está sin especificar
it: trovato %%guard senza che sia specificato %%semantic_parser

source: two actions at end of one rule
de: Zwei Aktionen am Ende einer Regel
es: dos acciones al final de una regla
it: due azioni alla fine di una regola

source: type clash (`%s' `%s') on default action
de: Typkonflikt (»%s« »%s«) bei Default Aktion
es: los tipos (`%s' `%s') no concuerdan en la acción por defecto
it: conflitto di tipo (`%s' e `%s') nell'azione di default

source: empty rule for typed nonterminal, and no action
de: leere Regel für Nicht-Terminal vmit Typ und keine Aktion
es: regla vacía para un no terminal con tipo y no hay ninguna acción
it: regola vuota e nessuna azione per un nonterminale con tipo

source: invalid input: %s
de: ungültige Eingabe: %s
es: entrada no válida: %s
it: input non valido: %s

source: too many symbols (tokens plus nonterminals); maximum %d
it: troppi simboli (token e nonterminali); il massimo è %d

source: no rules in the input grammar
de: Eingabegrammatik enthält keine Regeln
es: no hay reglas en la gramática de entrada
it: nessuna regola nella grammatica di input

source: symbol %s is used, but is not defined as a token and has no rules
de: Symbol %s wird benutzt, ist aber nicht als Token definiert und hat keine Regel
es: se usa el símbolo %s, pero no está definido como terminal y no tiene reglas
it: usato il simbolo %s, ma non è un token e non ha regole

source: tokens %s and %s both assigned number %d
it: i token %s e %s hanno lo stesso numero %d

source: conflicting precedences for %s and %s
de: Vorrangwertigkeiten für %s und %s widersprechen sich
es: precedencias en conflicto entre %s y %s
it: precedenze in conflitto per %s und %s

source: conflicting assoc values for %s and %s
de: assoc Werte für %s nd %s widersprechen sich
es: conflicto de valores assoc para %s y %s
it: associatività in conflitto per %s e %s

source: the start symbol %s is undefined
de: das Startsymbol %s ist undefiniert
es: el símbolo de inicio (axioma) %s no está definido
it: simbolo iniziale %s non definito

source: the start symbol %s is a token
de: das Startsymbol %s ist ein Token
es: el símbolo de inicio (axioma) %s es un terminal
it: specificato il token %s come simbolo iniziale

source: Useless nonterminals:
it: Simboli nonterminali inutili:

source: Terminals which are not used:
it: Simboli terminali inutilizzati:

source: Useless rules:
it: Regole inutili:

source: %d rule never reduced
it: %d regola non applicata

source: %d useless nonterminal
it: %d simbolo nonterminale inutilizzato

source: and
de: und
es: y
it: e

source: %d useless rule
it: %d regola inutile

source: Start symbol %s does not derive any sentence
de: es lassen sich keine Sätze vom Startsymbol %s ableiten
es: El símbolo de inicio (axioma) %s no deriva ninguna sentencia
it: dal simbolo iniziale %s non deriva alcuna frase

source: %s: option `%s' is ambiguous
de: %s: die Option »%s« ist nicht eindeutig
es: %s: la opción `%s' es ambigua
it: %s: l'opzione `%s' è ambigua

source: %s: option `--%s' doesn't allow an argument
de: %s: die Option »--%s« erlaubt kein Argument
es: %s: la opción `--%s' no admite ningún argumento
it: %s: l'opzione `--%s' non ammette argomenti

source: %s: option `%c%s' doesn't allow an argument
de: %s: die Option »%c%s« erlaubt kein Argument
es: %s: la opción `%c%s' no admite ningún argumento
it: %s: l'opzione `%c%s' non ammette argomenti

source: %s: option `%s' requires an argument
de: %s: die Option »%s« erfordert ein Argument
es: %s: la opción `%s' requiere un argumento
it: %s: l'opzione `%s' richiede un argomento

source: %s: unrecognized option `--%s'
de: %s: unbekannte Option »--%s«
es: %s: opción `--%s' no reconocida
it: %s: opzione sconosciuta `--%s'

source: %s: unrecognized option `%c%s'
de: %s: unbekannte Option »%c%s«
es: %s: opción `%c%s' no reconocida
it: %s: opzione sconosciuta `%c%s'

source: %s: illegal option -- %c
de: %s: die Option ist nicht erlaubt -- %c
es: %s: opción -- %c ilegal
it: %s: opzione non valida -- %c

source: %s: invalid option -- %c
de: %s: ungültige Option -- %c
es: %s: opción -- %c inválida
it: %s: opzione non valida -- %c

source: %s: option requires an argument -- %c
de: %s: die Option benötigt ein Argument -- %c
es: %s: la opción -- %c requiere un argumento
it: %s: l'opzione richiede un argomento -- %c

source: %s: option `-W %s' is ambiguous
it: %s: l'opzione `-W %s' è ambigua

source: %s: option `-W %s' doesn't allow an argument
it: %s: l'opzione `-W %s' non ammette un argomento

source: memory exhausted
it: memoria esaurita

source: shift
de: durch Schieben gelöst
es: desplaza

source: 1 shift/reduce conflict
de: 1 Schiebe/Reduziere Konflikt
es: 1 conflicto desplazamiento/reducción

source: %d shift/reduce conflicts
de: %d Schiebe/Reduziere Konflikte
es: %d conflictos desplazamiento/reducción

source: and
de: und
es: y

source: 1 reduce/reduce conflict
de: 1 Reduziere/Reduziere Konflikt
es: 1 conflicto reducción/reducción

source: %d reduce/reduce conflicts
de: %d Reduziere/Reduziere Konflikte
es: %d conflictos reducción/reducción

source: State %d contains
de: Zustand %d enthält
es: El estado %d contiene

source: %s contains
de: %s enthält
es: %s contiene

source: %s derives
de: %s leitet ab
es: %s deriva

source: Entering set_nullable
de: Führe »set_nullable« aus
es: Entrando set_nullable

source: rule %-4d %s ->
de: Regel %-4d %s ->
es: regla %-4d %s ->

source: /* empty */
de: /* leer */
es: /* vacía */

source: Variables ---------
de: Variablen ---------

source: Value Sprec Sassoc Tag
de: Wert Sprec Sassoc Tag
es: Valor Sprec Sasoc Tag

source: Rules -----
de: Regeln ------
es: Reglas ------

source: Rules interpreted -----------------
de: interpretierete Regeln ----------------------
es: Reglas interpretadas --------------------

source: %d rules never reduced
de: %d wurde niemals reduziert
es: %d reglas que nunca se han reducido

source: %d useless nonterminal%s
de: %d ungenutzte Nicht-Terminal
es: %d no terminales %s sin uso

source: %d useless rule%s
de: %d ungenutzte Regel
es: %d regla%s sin uso

source: reduced %s defines %d terminal%s, %d nonterminal%s, and %d production%s.
de: Reduzierung von %s definiert %d Terminal, %d Nicht-Terminal und %d Produktionen.
es: la reducción de %s define %d terminal%s, %d no terminal%s, y %d produccion%s.
